---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.MustReplacePanels
source: html/0a94dad4-55d7-fa94-45df-022ce30b9805.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.MustReplacePanels Property

Missing Curtain Panels will be replaced with System Panels to complete command.

## Syntax (C#)
```csharp
public static FailureDefinitionId MustReplacePanels { get; }
```